
# тут расписываю фазы цикла: менструальная, фолликулярная, овуляция, лютеиновая
# нужно пока отталкиваться от дня цикла, получается по подсказке мы можем использовать if/ else
# скорее всего также можно будет импортировать данные из tracker.py
# нужно еще добавить параметр продолжительсть period_duration

def phase_of_cycle(day: int):
    if day <= 5: 
        phase = "Менструация"
    elif day <= 11:
        phase = "Фолликулярная"
    elif day <= 16:
        phase = "Овуляция"
    else:
        phase = "Лютеиновая"
    return phase



